Revit 2024 API
IFCData Class
 A specialized type of abstract data block that can represent any data type.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class IFCData : IDisposable
Visual Basic
Public Class IFCData _
	Implements IDisposable
Visual C++
public ref class IFCData : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.IFCData
See Also
IFCData Members
Autodesk.Revit.DB.IFC Namespace